In [2]:
%load_ext sql
%sql sqlite:///tiny-college.db

## Part 2: SQL Query (10 points each)

In [67]:
%%sql
select name from sqlite_master
where type='table'
order by name;

 * sqlite:///tiny-college.db
Done.

[('CLASS',),
 ('COURSE',),
 ('DEPARTMENT',),
 ('PREREQ',),
 ('PROFESSOR',),
 ('STUDENT',)]

### Question 1 

Write a query to list the first and last names of all freshmen students and their advisors (professors).

In [12]:
%%sql
select stu_fname, stu_lname, prof_fname, prof_lname
from student s, professor p
where s.Prof_num=p.Prof_num and stu_grade='Fr'

 * sqlite:///tiny-college.db
Done.

[('John', 'Smith', 'Ismael', 'Osaki')]

### Question 2

Write a query to retrieve, for each class, the department name, course description, and the professor's last name.

In [9]:
%%sql
select class_code, dept_name, crs_description, prof_lname
from class cl, department d, course co, professor p
where cl.crs_code=co.crs_code and co.dept_code=d.dept_code and d.dept_code=p.dept_code

 * sqlite:///tiny-college.db
Done.

[(10012, 'Accounting', 'Accounting I', 'Graztevski'),
 (10012, 'Accounting', 'Accounting I', 'Heffington'),
 (10012, 'Accounting', 'Accounting I', 'Osaki'),
 (10013, 'Accounting', 'Accounting I', 'Graztevski'),
 (10013, 'Accounting', 'Accounting I', 'Heffington'),
 (10013, 'Accounting', 'Accounting I', 'Osaki'),
 (10014, 'Accounting', 'Accounting I', 'Graztevski'),
 (10014, 'Accounting', 'Accounting I', 'Heffington'),
 (10014, 'Accounting', 'Accounting I', 'Osaki'),
 (10015, 'Accounting', 'Accounting II', 'Graztevski'),
 (10015, 'Accounting', 'Accounting II', 'Heffington'),
 (10015, 'Accounting', 'Accounting II', 'Osaki'),
 (10016, 'Accounting', 'Accounting II', 'Graztevski'),
 (10016, 'Accounting', 'Accounting II', 'Heffington'),
 (10016, 'Accounting', 'Accounting II', 'Osaki'),
 (10017, 'Computer Info. Systems', 'Intro. to Microcomputing', 'Coronel'),
 (10017, 'Computer Info. Systems', 'Intro. to Microcomputing', 'Rob'),
 (10017, 'Computer Info. Systems', 'Intro. to Microcomputing', 'Smith'),
 (10018, 'Computer Info. Systems', 'Intro. to Microcomputing', 'Coronel'),
 (10018, 'Computer Info. Systems', 'Intro. to Microcomputing', 'Rob'),
 (10018, 'Computer Info. Systems', 'Intro. to Microcomputing', 'Smith'),
 (10019, 'Computer Info. Systems', 'Intro. to Microcomputing', 'Coronel'),
 (10019, 'Computer Info. Systems', 'Intro. to Microcomputing', 'Rob'),
 (10019, 'Computer Info. Systems', 'Intro. to Microcomputing', 'Smith'),
 (10020, 'Computer Info. Systems', 'Database Design and Implementation', 'Coronel'),
 (10020, 'Computer Info. Systems', 'Database Design and Implementation', 'Rob'),
 (10020, 'Computer Info. Systems', 'Database Design and Implementation', 'Smith'),
 (10021, 'Computer Info. Systems', 'Intro. to Statistics', 'Coronel'),
 (10021, 'Computer Info. Systems', 'Intro. to Statistics', 'Rob'),
 (10021, 'Computer Info. Systems', 'Intro. to Statistics', 'Smith'),
 (10022, 'Computer Info. Systems', 'Intro. to Statistics', 'Coronel'),
 (10022, 'Computer Info. Systems', 'Intro. to Statistics', 'Rob'),
 (10022, 'Computer Info. Systems', 'Intro. to Statistics', 'Smith'),
 (10023, 'Computer Info. Systems', 'Statistical Applications', 'Coronel'),
 (10023, 'Computer Info. Systems', 'Statistical Applications', 'Rob'),
 (10023, 'Computer Info. Systems', 'Statistical Applications', 'Smith'),
 (10024, 'Computer Info. Systems', 'Statistical Applications', 'Coronel'),
 (10024, 'Computer Info. Systems', 'Statistical Applications', 'Rob'),
 (10024, 'Computer Info. Systems', 'Statistical Applications', 'Smith'),
 (10025, 'Mathematics', 'Mathmatic for Managers', 'Jones'),
 (10025, 'Mathematics', 'Mathmatic for Managers', 'Ritula')]

### Question 3

Write a query to show all student numbers, student names, their professor names, and department names whose department code is ‘ACCT’ or ‘CIS’.

In [37]:
%%sql
select stu_num, stu_fname, stu_lname, prof_fname, prof_lname, dept_name 
from student s, professor p, department d
where s.dept_code=d.dept_code and p.prof_num=s.prof_num and p.dept_code=d.dept_code and (d.dept_code='ACCT' or d.dept_code='CIS')

 * sqlite:///tiny-college.db
Done.

[(324258, 'Juliette', 'Brewer', 'Gerald', 'Graztevski', 'Accounting'),
 (324274, 'Raphael', 'Katinga', 'Arnelle', 'Heffington', 'Accounting'),
 (324299, 'John', 'Smith', 'Ismael', 'Osaki', 'Accounting'),
 (324257, 'Anne', 'Smithson', 'Carlos', 'Coronel', 'Computer Info. Systems'),
 (324269, 'Walter', 'Oblonski', 'Melanie', 'Smith', 'Computer Info. Systems')]

### Question 4

Write a query to list the name of departments having equal or over 3 professors.

In [30]:
%%sql
select dept_name
from professor join department on professor.dept_code=department.dept_code
group by professor.dept_code
having count(prof_num) >= 3

 * sqlite:///tiny-college.db
Done.

[('Accounting',), ('Computer Info. Systems',), ('English',)]

### Question 4

Write a query to list the courses that have prerequisite courses. Show the course code, course_description, course code of the prerequisite course, course description of the prerequisite course.

In [90]:
%%sql
select distinct x.crs_code, x.crs_description, q.pre_take, (select y.crs_description from course y, prereq where q.pre_take=y.crs_code) as Pre_description
from course x, prereq q 
where q.crs_code=x.crs_code

 * sqlite:///tiny-college.db
Done.

[('CIS-420', 'Database Design and Implementation', 'CIS-220', 'Intro. to Microcomputing'),
 ('QM-261', 'Intro. to Statistics', 'MATH-243', 'Mathmatic for Managers'),
 ('QM-362', 'Statistical Applications', 'MATH-243', 'Mathmatic for Managers'),
 ('QM-362', 'Statistical Applications', 'QM-261', 'Intro. to Statistics')]

### Question 6

Write a query to show the names and department name of all professors who has no class.

In [63]:
%%sql
select prof_fname, prof_lname, dept_name 
from professor, department
where professor.dept_code not in (select dept_code from course) and department.dept_code=professor.dept_code

 * sqlite:///tiny-college.db
Done.

[('Ronald', 'Donelly', 'History'),
 ('Preston', 'Yukon', 'English'),
 ('Ross', 'Washington', 'Marketing/Management'),
 ('Van', 'Thieu', 'Biology'),
 ('Robert', 'Smith', 'English'),
 ('Willa', 'Dexter', 'Marketing/Management'),
 ('Herman', 'Williams', 'Psychology'),
 ('Doreen', 'Stoddard', 'Economics/Finance'),
 ('Todd', 'Wilson', 'English'),
 ('Suzanne', 'Jones', 'Sociology'),
 ('Elsa', 'Smith', 'Biology'),
 ('James', 'Ardano', 'History'),
 ('Kathryn', 'Williamson', 'Economics/Finance'),
 ('Jill', 'Herndon', 'Fine Arts')]